In [54]:
# Dependencies
import pandas as pd
import numpy as np

In [55]:
# Name of the CSV file
file = 'Resources/donors2008.csv'

In [56]:
# The correct encoding must be used to read the CSV in pandas
df = pd.read_csv(file, encoding="ISO-8859-1")

In [57]:
# Preview of the DataFrame
# Note that FIELD8 is likely a meaningless column
df.head()

  LastName FirstName          Employer      City State    Zip  Amount  FIELD8
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0     NaN
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0     NaN
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0     NaN
3    Adams  Lorraine              Self  New York    NY  10026   200.0     NaN
4    Adams    Marion              None    Exeter    NH  03833   100.0     NaN

In [58]:
# Delete extraneous column
del df['FIELD8']
df.head()

  LastName FirstName          Employer      City State    Zip  Amount
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0
3    Adams  Lorraine              Self  New York    NY  10026   200.0
4    Adams    Marion              None    Exeter    NH  03833   100.0

In [59]:
# Identify incomplete rows
df.count()

LastName     1776
FirstName    1776
Employer     1743
City         1776
State        1776
Zip          1776
Amount       1776
dtype: int64

### MK: Approach 1: Investigate Missing Rows and Fill NA
* This is how to setup the values to be complete, instead of dropping the Rows

In [60]:
df[df["Employer"].isna()].head(10)

    LastName FirstName Employer           City State         Zip  Amount
13     Ahuja  Maria T.      NaN       New York    NY       10021  1000.0
126   Berger   Harriet      NaN   Philadelphia    PA       19129  5000.0
149    Block    Milton      NaN         Naples    NY       14512   200.0
400  Donelan     Myrna      NaN         Durham    NC  27707-5711   250.0
460    Faber   Suzanne      NaN        Chicago    IL       60611  5000.0
491  Fizdale   Richard      NaN        Chicago    IL       60611  5000.0
519  Fritsch   Claudia      NaN        Atlanta    GA       30319   250.0
543  Gaylord   Marilyn      NaN          Lacey    WA  98503-2547    50.0
566  Gilbert   Barbara      NaN  Nicholasville    KY       40356   100.0
608   Graves     Scott      NaN      Arlington    VA       22201    50.0

In [61]:
# MK: Instead of dropping data, let's fill na's instead
df['Employer'] = df['Employer'].fillna(value='None')

In [62]:
# Check new counts
df.count()

LastName     1776
FirstName    1776
Employer     1776
City         1776
State        1776
Zip          1776
Amount       1776
dtype: int64

### MK: Approach 2: Drop Rows from DF if missing ANY value
* If I commented out the code above and simply cleaned out the records, they would disappear from the dataset

In [7]:
# Drop all rows with missing information
df = df.dropna(how='any')

In [8]:
# Verify dropped rows
df.count()

LastName     1743
FirstName    1743
Employer     1743
City         1743
State        1743
Zip          1743
Amount       1743
dtype: int64

In [63]:
# The Amount column is the wrong data type. It should be numeric.
df.dtypes

LastName      object
FirstName     object
Employer      object
City          object
State         object
Zip           object
Amount       float64
dtype: object

In [64]:
# Use pd.to_numeric() method to convert the datatype of the Amount column
df['Amount'] = pd.to_numeric(df['Amount'])

In [65]:
# Verify that the Amount column datatype has been made numeric
df['Amount'].dtype

dtype('float64')

In [72]:
# Display an overview of the Employers column
employer_counts = df['Employer'].value_counts()
employer_counts[:50]

None                                   282
Self                                   241
Retired                                126
Self Employed                           39
Self-Employed                           34
Google                                   6
Unemployed                               4
Not Employed                             4
Bank Of America                          3
University of California                 3
Social Security Administration           3
Mayer Brown                              2
Northern Trust                           2
Rainey Cluss LLC                         2
Ariel Investments                        2
Microsoft                                2
Mayer Brown LLP                          2
University of Michigan                   2
Berger & Montague                        2
Henry Crown & Company                    2
Davis Polk & Wardwell                    2
University of Washington                 2
State Department                         2
United Health Group                      2
CSC                                      2
Federal Government                       2
Skadden, Arps                            2
Jones Day                                2
Harvard University                       2
Covington & Burling                      2
Sidley Austin LLP                        2
Newton Public Schools                    2
UCLA                                     2
Kaiser Permanente                        2
Freelance                                2
LMI                                      2
ExxonMobil                               2
University Of Michigan                   2
Google, Inc.                             2
Quadrangle Group                         2
Hugo Neu Corporation                     2
University Hospital                      2
Mooney, Green, Baker & Saindon, PC.      1
Tel/Logic, Inc. dba E-Rate Central       1
George Washington University             1
U.S. State Department                    1
Granite Ventures, LLC                    1
Lion Oaks Ranch                          1
SEIU Local 32BJ                          1
Shearman&Sterling                        1
Name: Employer, dtype: int64

In [74]:
# MK Additional Sort the first 100 by Count and then resort by Index for easier Spelling Checks
employer_counts[:50].sort_index()

Ariel Investments                        2
Bank Of America                          3
Berger & Montague                        2
CSC                                      2
Covington & Burling                      2
Davis Polk & Wardwell                    2
ExxonMobil                               2
Federal Government                       2
Freelance                                2
George Washington University             1
Google                                   6
Google, Inc.                             2
Granite Ventures, LLC                    1
Harvard University                       2
Henry Crown & Company                    2
Hugo Neu Corporation                     2
Jones Day                                2
Kaiser Permanente                        2
LMI                                      2
Lion Oaks Ranch                          1
Mayer Brown                              2
Mayer Brown LLP                          2
Microsoft                                2
Mooney, Green, Baker & Saindon, PC.      1
Newton Public Schools                    2
None                                   282
Northern Trust                           2
Not Employed                             4
Quadrangle Group                         2
Rainey Cluss LLC                         2
Retired                                126
SEIU Local 32BJ                          1
Self                                   241
Self Employed                           39
Self-Employed                           34
Shearman&Sterling                        1
Sidley Austin LLP                        2
Skadden, Arps                            2
Social Security Administration           3
State Department                         2
Tel/Logic, Inc. dba E-Rate Central       1
U.S. State Department                    1
UCLA                                     2
Unemployed                               4
United Health Group                      2
University Hospital                      2
University Of Michigan                   2
University of California                 3
University of Michigan                   2
University of Washington                 2
Name: Employer, dtype: int64

In [76]:
# MK Export Full list to CSV for easier cleaning rules development
employer_counts.to_excel("cleaning_employer.xlsx")

In [77]:
# Clean up Employer category. Replace 'Self Employed' and 'Self' with 'Self-Employed'
df['Employer'] = df['Employer'].replace(
    {'Self Employed': 'Self-Employed', 'Self': 'Self-Employed'})

In [78]:
# Verify clean-up.
df['Employer'].value_counts()

Self-Employed                         314
None                                  282
Retired                               126
Google                                  6
Unemployed                              4
Not Employed                            4
Bank Of America                         3
University of California                3
Social Security Administration          3
Berger & Montague                       2
Mayer Brown                             2
Northern Trust                          2
Rainey Cluss LLC                        2
Ariel Investments                       2
Microsoft                               2
Harvard University                      2
Federal Government                      2
University Hospital                     2
Davis Polk & Wardwell                   2
Mayer Brown LLP                         2
Henry Crown & Company                   2
United Health Group                     2
CSC                                     2
State Department                        2
University of Michigan                  2
University of Washington                2
Covington & Burling                     2
Skadden, Arps                           2
Newton Public Schools                   2
University Of Michigan                  2
                                     ...
Jonathon Rose Co.                       1
New Mexico Tech                         1
Firstbank Puerto Rico                   1
Noblis                                  1
Capital Group Companies                 1
Sotheby's International Realty          1
Commonwealth Of Pennsylvania            1
University Of Wisconsin                 1
Help/Systems                            1
Baruch College                          1
Alagem Capital Group                    1
Citadel Investment Group                1
Youth Advocate Program                  1
RAND Corporation                        1
Sidley Austin                           1
Seastack Enterprises                    1
Dept Of Vet Affairs                     1
AltusWorks                              1
County Bank                             1
Seagate Technology                      1
Jewish Federation of Metro Chicago      1
Self - Snider Enterprises               1
Excel Care Inc                          1
Retired U of IL                         1
CBS Studios Inc.                        1
Danish Refugee Council                  1
Wendy's International, Inc              1
VCUHS                                   1
Netsoftusa                              1
State Of Michigan                       1
Name: Employer, Length: 1009, dtype: int64

In [79]:
df['Employer'] = df['Employer'].replace({'Not Employed': 'Unemployed'})
df['Employer'].value_counts()

Self-Employed                         314
None                                  282
Retired                               126
Unemployed                              8
Google                                  6
Bank Of America                         3
Social Security Administration          3
University of California                3
State Department                        2
Rainey Cluss LLC                        2
Microsoft                               2
University of Michigan                  2
Mayer Brown LLP                         2
CSC                                     2
Henry Crown & Company                   2
United Health Group                     2
Federal Government                      2
University of Washington                2
Mayer Brown                             2
Davis Polk & Wardwell                   2
Ariel Investments                       2
Harvard University                      2
Covington & Burling                     2
Kaiser Permanente                       2
Quadrangle Group                        2
LMI                                     2
Jones Day                               2
Northern Trust                          2
Newton Public Schools                   2
ExxonMobil                              2
                                     ...
Jonathon Rose Co.                       1
New Mexico Tech                         1
Firstbank Puerto Rico                   1
Noblis                                  1
Capital Group Companies                 1
Sotheby's International Realty          1
Commonwealth Of Pennsylvania            1
University Of Wisconsin                 1
Help/Systems                            1
Baruch College                          1
Alagem Capital Group                    1
Citadel Investment Group                1
Youth Advocate Program                  1
RAND Corporation                        1
Sidley Austin                           1
Seastack Enterprises                    1
Dept Of Vet Affairs                     1
AltusWorks                              1
County Bank                             1
Seagate Technology                      1
Jewish Federation of Metro Chicago      1
Self - Snider Enterprises               1
Excel Care Inc                          1
Retired U of IL                         1
CBS Studios Inc.                        1
Danish Refugee Council                  1
Wendy's International, Inc              1
VCUHS                                   1
Netsoftusa                              1
State Of Michigan                       1
Name: Employer, Length: 1008, dtype: int64

In [80]:
# Display a statistical overview
# We can infer the maximum allowable individual contribution from 'max'
df.describe()

            Amount
count  1776.000000
mean    659.311622
std    1274.416858
min       5.000000
25%     200.000000
50%     250.000000
75%     500.000000
max    5000.000000